# IMPORTING LIBRARIES

In [1]:
import numpy as np
import pandas as pd

# EMPTY DATAFRAME

In [2]:
empty_df=pd.DataFrame()

In [3]:
empty_df

Empty DataFrame
Columns: []
Index: []

In [4]:
type(empty_df)

pandas.core.frame.DataFrame

# CREATING DATAFRAME WITH LIST

In [5]:
lst1=[1,2,3,4,5]

In [6]:
lst_df=pd.DataFrame(lst1)

In [7]:
lst_df

   0
0  1
1  2
2  3
3  4
4  5

In [8]:
lst_of_lst1=[[1,2,3],[4,5,6],[7,8,9]]

In [9]:
lst_of_lst_df=pd.DataFrame(lst_of_lst1)

In [10]:
lst_of_lst_df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

# TRANSPOSING DATAFRAME

In [12]:
transposed_df=lst_of_lst_df.T

In [13]:
transposed_df

   0  1  2
0  1  4  7
1  2  5  8
2  3  6  9

# ACCESSING ROWS AND COLUMNS OF  DATAFRAME

In [56]:
lst_of_lst_df[1:3]

   0  1  2
1  4  5  6
2  7  8  9

In [59]:
lst_of_lst_df[1]

0    2
1    5
2    8
Name: 1, dtype: int64

In [61]:
lst_of_lst_df[[1,2]]

   1  2
0  2  3
1  5  6
2  8  9

In [63]:
lst_of_lst_df[names=['a','b'.'c']]

SyntaxError: invalid syntax (<ipython-input-63-894133844a2d>, line 1)

# CREATING DATAFRAME WITH DICT

In [14]:
dict1={'ID':[11,22,33,44]}

In [15]:
dict1

{'ID': [11, 22, 33, 44]}

In [16]:
dict_df=pd.DataFrame(dict1)

In [17]:
dict_df

   ID
0  11
1  22
2  33
3  44

In [18]:
dict1['SN']=[1,2,3,4]

In [19]:
dict1

{'ID': [11, 22, 33, 44], 'SN': [1, 2, 3, 4]}

In [20]:
dict_df2=pd.DataFrame(dict1)

In [21]:
dict_df2

   ID  SN
0  11   1
1  22   2
2  33   3
3  44   4

In [22]:
dict_df2=pd.DataFrame(dict1,index=['a','b','c','d'])

In [23]:
dict_df2

   ID  SN
a  11   1
b  22   2
c  33   3
d  44   4

In [40]:
dict_df2.index

RangeIndex(start=0, stop=4, step=1)

In [24]:
dict_df2=pd.DataFrame(dict1,dtype=float)

In [25]:
dict_df2

     ID   SN
0  11.0  1.0
1  22.0  2.0
2  33.0  3.0
3  44.0  4.0

In [26]:
dict_df2=pd.DataFrame(dict1,name='data values')

TypeError: __init__() got an unexpected keyword argument 'name'

# CREATING DATAFRAME WITH LIST OF DICT

In [27]:
lst_of_dict=[{'a':1,'b':2},{'a':3,'b':4}]

In [28]:
lst_of_dict

[{'a': 1, 'b': 2}, {'a': 3, 'b': 4}]

In [29]:
lst_of_dict_df=pd.DataFrame(lst_of_dict)

In [30]:
lst_of_dict_df

   a  b
0  1  2
1  3  4

In [31]:
lst_of_dict2=[{'a':1,'b':2},{'a':3,'b':4,'c':5}]

In [32]:
lst_of_dict_df2=pd.DataFrame(lst_of_dict2)

In [33]:
lst_of_dict_df2

   a  b    c
0  1  2  NaN
1  3  4  5.0

# CRETING DATAFRAME WITH SERIES

In [34]:
dict_sr={'ID':pd.Series([1,2,3]),'SN':pd.Series([111,222,333])}

In [36]:
dict_sr

{'ID': 0    1
 1    2
 2    3
 dtype: int64,
 'SN': 0    111
 1    222
 2    333
 dtype: int64}

In [37]:
dict_sr_df=pd.DataFrame(dict_sr)

In [38]:
dict_sr_df

   ID   SN
0   1  111
1   2  222
2   3  333

# DATAFRAME INDEX, SET_INDEX, RESET_INDEX

In [39]:
dict_sr_df.index

RangeIndex(start=0, stop=3, step=1)

In [41]:
dict_sr_df.set_index('ID')

     SN
ID
1   111
2   222
3   333

In [42]:
dict_sr_df

   ID   SN
0   1  111
1   2  222
2   3  333

In [43]:
dict_sr_df.set_index('SN')

     ID
SN
111   1
222   2
333   3

In [44]:
dict_sr_df

   ID   SN
0   1  111
1   2  222
2   3  333

In [45]:
dict_sr_df.set_index('SN',inplace=True)

In [46]:
dict_sr_df

     ID
SN
111   1
222   2
333   3

In [49]:
dict_sr_df.reset_index(inplace=True)

In [50]:
dict_sr_df

    SN  ID
0  111   1
1  222   2
2  333   3

In [53]:
ind=['m','n','o']
dict_sr_df.set_index(ind,inplace=True)

KeyError: "None of ['m', 'n', 'o'] are in the columns"

In [64]:
dict_sr_df.index=['m','n','o']

In [65]:
dict_sr_df

    SN  ID
m  111   1
n  222   2
o  333   3

In [66]:
dict_sr_df.index.name='sec'

In [67]:
dict_sr_df

      SN  ID
sec
m    111   1
n    222   2
o    333   3

# DATAFRAME COLUMNS AND DESCRIBE

In [68]:
dict_sr_df.columns

Index(['SN', 'ID'], dtype='object')

In [69]:
dict_sr_df.describe

<bound method NDFrame.describe of       SN  ID
sec
m    111   1
n    222   2
o    333   3>

# HEAD AND TAIL METHOD

In [71]:
dict_sr_df.head(2)

      SN  ID
sec
m    111   1
n    222   2

In [73]:
dict_sr_df.tail(1)

      SN  ID
sec
o    333   3